[
  {
    "id": "news-1",
    "title": "Congratulations to Our 2025 Graduates at Lakehead University Convocation",
    "summary": "VIDLab celebrates the academic achievements of Christopher Silver, Nusrat Jahan, Tharrengini Suresh, and Harish Sundaralingam who attended the Spring 2025 Convocation ceremony at Lakehead University.",
    "image": "assets/images/news/news (1).jpg",
    "date": "May 30, 2025",
    "content": "<div class='caption text-center mt-2'><small class='text-muted'>Lakehead University Spring 2025 Convocation Ceremony - Thunder Bay Campus</small></div><h5><br>Celebrating Academic Excellence and Research Achievements!</h5><p>We are incredibly proud to congratulate our outstanding graduates Christopher Silver, Nusrat Jahan, Tharrengini Suresh, and Harish Sundaralingam who participated in Lakehead University's Spring 2025 Convocation ceremonies. Their dedication to research and academic excellence exemplifies the high standards of VIDLab.</p><p>The Spring 2025 Convocation ceremonies at Lakehead University's Thunder Bay campus took place from May 29-30, 2025, celebrating the achievements of graduating students across all faculties. Our graduates participated in multiple ceremony sessions, with each ceremony running approximately 2.5 hours and followed by receptions at the campus surrounding Lake Tamblyn and inside the Agora (University Centre).</p><p>Dr. Akilan commented: 'Watching our students achieve their academic milestones is one of the most rewarding aspects of leading VIDLab. Christopher, Nusrat, Tharrengini, and Harish have demonstrated exceptional research capabilities and dedication. Their work in areas ranging from semantic segmentation to object detection will have lasting impact on the field.'</p><p><strong>Graduate Achievements:</strong></p><ul><li><strong>Christopher Silver:</strong> Completed his MSc in Computer Science with research focus on advanced computer vision algorithms and deep learning applications</li><li><strong>Nusrat Jahan:</strong> Completed her MSc in Electrical and Computer Engineering with research focus on 'An Improved Semi-Supervised Learning Framework for Image Semantic Segmentation'</li><li><strong>Tharrengini Suresh:</strong> Graduated with distinction with her MSc in Electrical and Computer Engineering, contributing to 'Semantic Segmentation with Edge-Context Enrichment and Attention Strategies: A Refined Framework for Improved Performance in Complex Visual Environments'</li><li><strong>Harish Sundaralingam:</strong> Achieved his MSc in Electrical and Computer Engineering, specializing in 'Enhancing Object Detection in Complex Scenes: A Semantic Segmentation-aware Framework with Attention-Gating for Improved Small Object Detection'</li></ul><div class='row g-3 my-4'><div class='col-md-6'><img src='assets/images/gallery/Convocation (1).jpg' class='img-fluid rounded' alt='Tharrengini Suresh' style='height: 350px; width: 100%; object-fit: contain; background-color: #f8f9fa;'><div class='caption text-center mt-2'><small class='text-muted'>Tharrengini Suresh</small></div></div><div class='col-md-6'><img src='assets/images/gallery/Convocation (2).jpg' class='img-fluid rounded' alt='Graduating Student Harish' style='height: 350px; width: 100%; object-fit: contain; background-color: #f8f9fa;'><div class='caption text-center mt-2'><small class='text-muted'>Harish Sundaralingam</small></div></div></div><p>The Thunder Bay convocation ceremonies were held at Lakehead University's campus (955 Oliver Road), with graduates from the Faculty of Natural Resources Management, Faculty of Science and Environmental Studies, and Faculty of Social Sciences and Humanities participating in the May 30th morning ceremony. Each ceremony provided an exceptional opportunity for graduates to join their classmates and professors in celebrating their accomplishments at Lakehead.</p><p>We wish our graduates continued success in their future endeavors and look forward to their continued contributions to the field of intelligent systems and data analytics.</p><div class='news_footer text-center'><a href='https://www.lakeheadu.ca/studentcentral/graduating/convocation/tbay-ceremony' class='btn btn-light btn-custom'>Learn More About Lakehead Convocation</a></div>"
  },
  
  {
    "id": "news-2",
    "title": "Dr. Akilan Selected as Invited Speaker at ICSIP 2025",
    "summary": "Associate Professor Thangarajah Akilan from VIDLab has been honored as an invited speaker at the International Conference on Signal and Image Processing (ICSIP) 2025, recognizing his outstanding contributions to computer vision and signal processing research.",
    "image": "assets/images/news/news (2).jpg",
    "date": "July 8, 2025",
    "content": "<h5>Prestigious International Recognition for VIDLab Leadership!</h5><p>We are delighted to announce that Associate Professor Thangarajah Akilan, Director of the Vision Intelligence and Data Lab (VIDLab), has been selected as an invited speaker at the International Conference on Signal and Image Processing (ICSIP) 2025. This prestigious invitation acknowledges Dr. Akilan's significant contributions to the advancement of signal processing, computer vision, and intelligent systems research.</p><p>ICSIP 2025 is a premier international conference that brings together world-renowned researchers, academics, and industry leaders to present cutting-edge developments in signal processing, image analysis, pattern recognition, and related fields. Being selected as an invited speaker at this prestigious venue highlights the international recognition of Dr. Akilan's research excellence and VIDLab's growing influence in the global research community.</p><p><strong>Conference Highlights:</strong></p><ul><li><strong>Conference:</strong> International Conference on Signal and Image Processing (ICSIP) 2025</li><li><strong>Invited Speaker:</strong> Associate Professor Thangarajah Akilan</li><li><strong>Affiliation:</strong> Vision Intelligence and Data Lab (VIDLab), Lakehead University</li><li><strong>Research Focus:</strong> Advanced signal processing techniques, computer vision, and machine learning applications</li></ul><p>Dr. Akilan's invited presentation will showcase VIDLab's innovative research in developing efficient algorithms for real-world signal and image processing challenges. His work spans multiple domains including semantic segmentation, object detection, medical image analysis, and intelligent systems design, with particular emphasis on creating practical solutions that bridge the gap between theoretical advances and real-world applications.</p><p>'I am deeply honored to be invited as a speaker at ICSIP 2025,' commented Dr. Akilan. 'This platform provides an excellent opportunity to share our latest research findings with the international community and to explore new collaborative possibilities. Our work at VIDLab focuses on developing robust and efficient algorithms that can address complex real-world challenges in signal and image processing.'</p><p>The invitation reflects the high quality and impact of research conducted at VIDLab under Dr. Akilan's leadership. This recognition further establishes VIDLab as a center of excellence in vision intelligence and data analytics, contributing to advancements that benefit both academic research and industrial applications.</p><p>This prestigious speaking engagement will enhance VIDLab's international visibility and provide opportunities for new research collaborations and partnerships with leading institutions worldwide.</p><div class='news_footer text-center'><a href='https://www.icsip.org/' class='btn btn-light btn-custom'>Learn More About ICSIP 2025</a></div>"
  }
]
