[
  {
    "id": "news-1",
    "title": "Congratulations to Our 2025 Graduates at Lakehead University Convocation",
    "summary": "VIDLab celebrates the academic achievements of Christopher Silver, Nusrat Jahan, Tharrengini Suresh, and Harish Sundaralingam who attended the Spring 2025 Convocation ceremony at Lakehead University.",
    "image": "assets/images/news/news (1).jpg",
    "date": "May 30, 2025",
    "content": "<div class='caption text-center mt-2'><small class='text-muted'>Lakehead University Spring 2025 Convocation Ceremony - Thunder Bay Campus</small></div><h5><br>Celebrating Academic Excellence and Research Achievements!</h5><p>We are incredibly proud to congratulate our outstanding graduates Christopher Silver, Nusrat Jahan, Tharrengini Suresh, and Harish Sundaralingam who participated in Lakehead University's Spring 2025 Convocation ceremonies. Their dedication to research and academic excellence exemplifies the high standards of VIDLab.</p><p>The Spring 2025 Convocation ceremonies at Lakehead University's Thunder Bay campus took place from May 29-30, 2025, celebrating the achievements of graduating students across all faculties. Our graduates participated in multiple ceremony sessions, with each ceremony running approximately 2.5 hours and followed by receptions at the campus surrounding Lake Tamblyn and inside the Agora (University Centre).</p><p>Dr. Akilan commented: 'Watching our students achieve their academic milestones is one of the most rewarding aspects of leading VIDLab. Christopher, Nusrat, Tharrengini, and Harish have demonstrated exceptional research capabilities and dedication. Their work in areas ranging from semantic segmentation to object detection will have lasting impact on the field.'</p><p><strong>Graduate Achievements:</strong></p><ul><li><strong>Christopher Silver:</strong> Completed his MSc in Electrical and Computer Engineering with research focus on advanced computer vision algorithms and deep learning applications</li><li><strong>Nusrat Jahan:</strong> Completed her MSc in Electrical and Computer Engineering with research focus on 'An Improved Semi-Supervised Learning Framework for Image Semantic Segmentation'</li><li><strong>Tharrengini Suresh:</strong> Graduated with distinction with her MSc in Electrical and Computer Engineering, contributing to 'Semantic Segmentation with Edge-Context Enrichment and Attention Strategies: A Refined Framework for Improved Performance in Complex Visual Environments'</li><li><strong>Harish Sundaralingam:</strong> Achieved his MSc in Electrical and Computer Engineering, specializing in 'Enhancing Object Detection in Complex Scenes: A Semantic Segmentation-aware Framework with Attention-Gating for Improved Small Object Detection'</li></ul><div class='row g-3 my-4'><div class='col-md-4'><img src='assets/images/gallery/Convocation (2).jpeg' class='img-fluid rounded' alt='Nusrat Jahan' style='height: 350px; width: 100%; object-fit: contain; background-color: #f8f9fa;'>        <div class='caption text-center mt-2'><small class='text-muted'>Left: Nusrat Jahan, Right: Christopher Silver</small></div></div><div class='col-md-4'><img src='assets/images/gallery/Convocation (6).jpg' class='img-fluid rounded' alt='' style='height: 350px; width: 100%; object-fit: contain; background-color: #f8f9fa;'><div class='caption text-center mt-2'><small class='text-muted'>Tharrengini Suresh</small></div></div><div class='col-md-4'><img src='assets/images/gallery/Convocation (5).jpg' class='img-fluid rounded' alt='Harish Sundaralingam' style='height: 350px; width: 100%; object-fit: contain; background-color: #f8f9fa;'><div class='caption text-center mt-2'><small class='text-muted'>Harish Sundaralingam</small></div></div></div><p>The Thunder Bay convocation ceremonies were held at Lakehead University's campus (955 Oliver Road), with graduates from the Faculty of Natural Resources Management, Faculty of Science and Environmental Studies, and Faculty of Social Sciences and Humanities participating in the May 30th morning ceremony. Each ceremony provided an exceptional opportunity for graduates to join their classmates and professors in celebrating their accomplishments at Lakehead.</p><p>We wish our graduates continued success in their future endeavors and look forward to their continued contributions to the field of intelligent systems and data analytics.</p><div class='news_footer text-center'><a href='https://www.lakeheadu.ca/studentcentral/graduating/convocation/tbay-ceremony' class='btn btn-light btn-custom'>Learn More About Lakehead Convocation</a></div>"
  },
  
  {
    "id": "news-2",
    "title": "Dr. Akilan Selected as Invited Speaker at ICSIP 2025",
    "summary": "Dr. Akilan, Director of VIDLab, has been selected as an invited speaker at the International Conference on Signal and Image Processing (ICSIP) 2025.",
    "image": "assets/images/news/news (2).png",
    "date": "July 8, 2025",
    "content": "<h5>Invited Speaker at ICSIP 2025</h5><p>We are delighted to announce that Dr. Akilan, Director of the Vision Intelligence and Data Lab (VIDLab), has been selected as an invited speaker at the International Conference on Signal and Image Processing (ICSIP) 2025 on the topic 'The Emergence of Self-supervised Learning in Medical Image Semantic Segmentation'.</p><p>For more information - <a href='https://www.icsip.org/invite.html' target='_blank'>Welcome to 10th ICSIP 2025</a></p><div class='news_footer text-center'><a href='https://www.icsip.org/invite.html' class='btn btn-light btn-custom'>Learn More About ICSIP 2025</a></div>"
  },
  
  {
    "id": "news-3",
    "title": "Christopher Silver's Research Published in Engineering Applications of Artificial Intelligence Journal",
    "summary": "Congratulations to Christopher Silver for the acceptance of his work on thermal imaging-based fall detection in a prestigious international journal.",
    "image": "assets/images/news/news (3).png",
    "date": "July 22, 2025",
    "content": "<h5>Research Publication Success!</h5><p>Congratulations to Christopher Silver for the acceptance of the work titled 'Thermal Fall 66: A Robust Dataset for Thermal Imaging-based Fall Detection and Eldercare' in the Engineering Applications of Artificial Intelligence Journal.</p><p>This research contributes significantly to the field of eldercare technology and thermal imaging applications, demonstrating VIDLab's continued excellence in developing practical AI solutions for healthcare and safety applications.</p><div class='news_footer text-center'><a href='https://www.sciencedirect.com/journal/engineering-applications-of-artificial-intelligence' class='btn btn-light btn-custom'>View Journal</a></div>"
  }
]
