[
  {
    "id": "news-6",
    "title": "Chee Mei Ling (Irene)'s Defense and Luncheon",
    "summary": "Congratulations to Chee Mei Ling (Irene) on successfully defending her thesis on December 4th! The day also featured a VIDLab luncheon with guest speaker Christopher Silver.",
    "image": "assets/images/gallery/Irene Defense (2).jpg",
    "date": "December 4, 2025",
    "content": "<h5>Irene's Successful Thesis Defense</h5><p>We are thrilled to congratulate <strong>Chee Mei Ling (Irene)</strong> on the successful defense of her Master's thesis on December 4, 2025. Irene delivered an outstanding presentation on her research, '<em>Dual Atrous Separable Convolution for Improving Agricultural Semantic Segmentation</em>', which was met with appreciation and commendation from the examining committee members.</p><p>The committee praised Irene's comprehensive research methodology, innovative approach to agricultural image analysis, and her clear communication of complex technical concepts. Her work on the DAS-Conv module and its application to precision agriculture represents a significant contribution to the field of computer vision and agricultural technology.</p><p>Dr. Akilan commented: 'Irene's presentation was exemplary. She demonstrated not only deep technical knowledge but also a clear vision for how her research can make a practical impact in precision agriculture. The committee members were particularly impressed by her thorough experimental validation and insightful analysis.'</p><h5>Lab Luncheon & Guest Talk</h5><p>Following Irene's defense, VIDLab hosted a luncheon with guest speaker <strong>Christopher Silver</strong>, who shared recent insights from his research and experiences. The event brought together faculty, students, and collaborators for an informal discussion and networking lunch, creating a wonderful atmosphere to celebrate Irene's achievement.</p><p>Below are photos from Irene's defense and the luncheon:</p><div class='row g-3 my-4'><div class='col-md-6'><img src='assets/images/gallery/Luncehon (1).jpg' class='img-fluid rounded' alt='Luncheon 1' style='height: 350px; width: 100%; object-fit: cover; background-color: #f8f9fa;'></div><div class='col-md-6'><img src='assets/images/gallery/Luncehon (2).jpg' class='img-fluid rounded' alt='Luncheon 2' style='height: 350px; width: 100%; object-fit: cover; background-color: #f8f9fa;'></div></div><div class='row g-3 my-4'><div class='col-md-4'><img src='assets/images/gallery/Irene Defense (2).jpg' class='img-fluid rounded' alt='Irene Defense' style='height: 250px; width: 100%; object-fit: cover; background-color: #f8f9fa;'></div><div class='col-md-4'><img src='assets/images/gallery/Irene Defense (3).jpg' class='img-fluid rounded' alt='Irene Defense 2' style='height: 250px; width: 100%; object-fit: cover; background-color: #f8f9fa;'></div><div class='col-md-4'><img src='assets/images/gallery/Irene Defense (4).jpg' class='img-fluid rounded' alt='Irene Defense 3' style='height: 250px; width: 100%; object-fit: cover; background-color: #f8f9fa;'></div></div><div class='news_footer text-center'><a href='gallery.html' class='btn btn-light btn-custom'>View Full Gallery</a></div>"
  },
  {
    "id": "news-1",
    "title": "Chee Mei Ling (Irene)'s Paper Accepted at ASIG 2025",
    "summary": "Congratulations to Chee Mei Ling (Irene), Thangarajah Akilan, and Aparna Ravinda Phalke for the acceptance of their paper to ASIG 2025.",
    "image": "assets/images/news/news (4).png",
    "date": "November 26, 2025",
    "content": "<h5>Paper Acceptance at ASIG 2025</h5><p>Congratulations to <strong>Chee Mei Ling (Irene)</strong>, <strong>Thangarajah Akilan</strong>, and <strong>Aparna Ravinda Phalke</strong> for the acceptance of their paper titled <em>'Dual Atrous Separable Convolution for Improving Agricultural Semantic Segmentation'</em> to the <strong>3rd Asia Symposium on Image and Graphics (ASIG 2025)</strong>, to be held during November 28-30, 2025 in Osaka, Japan.</p><div class='news_footer text-center'><a href='https://asig.net/index.html' class='btn btn-light btn-custom'>Learn More About ASIG 2025</a></div>"
  },
  {
    "id": "news-2",
    "title": "Gaeul Han's Paper Accepted at ASIG 2025",
    "summary": "Congratulations to Gaeul Han, Thangarajah Akilan, and Arunya Prasantha Senadeera for the acceptance of their paper to ASIG 2025.",
    "image": "assets/images/news/news (4).png",
    "date": "November 26, 2025",
    "content": "<h5>Paper Acceptance at ASIG 2025</h5><p>Congratulations to <strong>Gaeul Han</strong>, <strong>Thangarajah Akilan</strong>, and <strong>Arunya Prasantha Senadeera</strong> for the acceptance of their paper titled <em>'SEA-YOLO: Thermal Imaging Object Detection via Spatial Edge Attention for Low-visibility Autonomous Driving'</em> to the <strong>3rd Asia Symposium on Image and Graphics (ASIG 2025)</strong>, to be held during November 28-30, 2025 in Osaka, Japan.</p><div class='news_footer text-center'><a href='https://asig.net/index.html' class='btn btn-light btn-custom'>Learn More About ASIG 2025</a></div>"
  },
  {
    "id": "news-3",
    "title": "Congratulations to Our 2025 Graduates at Lakehead University Convocation",
    "summary": "VIDLab celebrates the academic achievements of Christopher Silver, Nusrat Jahan, Tharrengini Suresh, and Harish Sundaralingam who attended the Spring 2025 Convocation ceremony at Lakehead University.",
    "image": "assets/images/news/news (1).jpg",
    "date": "May 30, 2025",
    "content": "<div class='caption text-center mt-2'><small class='text-muted'>Lakehead University Spring 2025 Convocation Ceremony - Thunder Bay Campus</small></div><h5><br>Celebrating Academic Excellence and Research Achievements!</h5><p>We are incredibly proud to congratulate our outstanding graduates Christopher Silver, Nusrat Jahan, Tharrengini Suresh, and Harish Sundaralingam who participated in Lakehead University's Spring 2025 Convocation ceremonies. Their dedication to research and academic excellence exemplifies the high standards of VIDLab.</p><p>The Spring 2025 Convocation ceremonies at Lakehead University's Thunder Bay campus took place from May 29-30, 2025, celebrating the achievements of graduating students across all faculties. Our graduates participated in multiple ceremony sessions, with each ceremony running approximately 2.5 hours and followed by receptions at the campus surrounding Lake Tamblyn and inside the Agora (University Centre).</p><p>Dr. Akilan commented: 'Watching our students achieve their academic milestones is one of the most rewarding aspects of leading VIDLab. Christopher, Nusrat, Tharrengini, and Harish have demonstrated exceptional research capabilities and dedication. Their work in areas ranging from semantic segmentation to object detection will have lasting impact on the field.'</p><p><strong>Graduate Achievements:</strong></p><ul><li><strong>Christopher Silver:</strong> Completed his MSc in Electrical and Computer Engineering with research focus on advanced computer vision algorithms and deep learning applications</li><li><strong>Nusrat Jahan:</strong> Completed her MSc in Electrical and Computer Engineering with research focus on 'An Improved Semi-Supervised Learning Framework for Image Semantic Segmentation'</li><li><strong>Tharrengini Suresh:</strong> Graduated with distinction with her MSc in Electrical and Computer Engineering, contributing to 'Semantic Segmentation with Edge-Context Enrichment and Attention Strategies: A Refined Framework for Improved Performance in Complex Visual Environments'</li><li><strong>Harish Sundaralingam:</strong> Achieved his MSc in Electrical and Computer Engineering, specializing in 'Enhancing Object Detection in Complex Scenes: A Semantic Segmentation-aware Framework with Attention-Gating for Improved Small Object Detection'</li></ul><div class='row g-3 my-4'><div class='col-md-4'><img src='assets/images/gallery/Convocation (2).jpeg' class='img-fluid rounded' alt='Nusrat Jahan' style='height: 350px; width: 100%; object-fit: contain; background-color: #f8f9fa;'><div class='caption text-center mt-2'><small class='text-muted'>Left: Nusrat Jahan, Right: Christopher Silver</small></div></div><div class='col-md-4'><img src='assets/images/gallery/Convocation (6).jpg' class='img-fluid rounded' alt='' style='height: 350px; width: 100%; object-fit: contain; background-color: #f8f9fa;'><div class='caption text-center mt-2'><small class='text-muted'>Tharrengini Suresh</small></div></div><div class='col-md-4'><img src='assets/images/gallery/Convocation (5).jpg' class='img-fluid rounded' alt='Harish Sundaralingam' style='height: 350px; width: 100%; object-fit: contain; background-color: #f8f9fa;'><div class='caption text-center mt-2'><small class='text-muted'>Harish Sundaralingam</small></div></div></div><p>The Thunder Bay convocation ceremonies were held at Lakehead University's campus (955 Oliver Road), with graduates from the Faculty of Natural Resources Management, Faculty of Science and Environmental Studies, and Faculty of Social Sciences and Humanities participating in the May 30th morning ceremony. Each ceremony provided an exceptional opportunity for graduates to join their classmates and professors in celebrating their accomplishments at Lakehead.</p><p>We wish our graduates continued success in their future endeavors and look forward to their continued contributions to the field of intelligent systems and data analytics.</p><div class='news_footer text-center'><a href='https://www.lakeheadu.ca/studentcentral/graduating/convocation/tbay-ceremony' class='btn btn-light btn-custom'>Learn More About Lakehead Convocation</a></div>"
  },
  {
    "id": "news-4",
    "title": "Dr. Akilan Selected as Invited Speaker at ICSIP 2025",
    "summary": "Dr. Akilan, Director of VIDLab, has been selected as an invited speaker at the International Conference on Signal and Image Processing (ICSIP) 2025.",
    "image": "assets/images/news/news (2).png",
    "date": "July 8, 2025",
    "content": "<h5>Invited Speaker at ICSIP 2025</h5><p>We are delighted to announce that Dr. Akilan, Director of the Vision Intelligence and Data Lab (VIDLab), has been selected as an invited speaker at the International Conference on Signal and Image Processing (ICSIP) 2025 on the topic 'The Emergence of Self-supervised Learning in Medical Image Semantic Segmentation'.</p><p>For more information - <a href='https://www.icsip.org/invite.html' target='_blank'>Welcome to 10th ICSIP 2025</a></p><div class='news_footer text-center'><a href='https://www.icsip.org/invite.html' class='btn btn-light btn-custom'>Learn More About ICSIP 2025</a></div>"
  },
  {
    "id": "news-5",
    "title": "Christopher Silver's Research Published in Engineering Applications of Artificial Intelligence Journal",
    "summary": "Congratulations to Christopher Silver for the acceptance of his work on thermal imaging-based fall detection in a prestigious international journal.",
    "image": "assets/images/news/news (3).png",
    "date": "July 22, 2025",
    "content": "<h5>Research Publication Success!</h5><p>Congratulations to Christopher Silver for the acceptance of the work titled 'Thermal Fall 66: A Robust Dataset for Thermal Imaging-based Fall Detection and Eldercare' in the Engineering Applications of Artificial Intelligence Journal.</p><p>This research contributes significantly to the field of eldercare technology and thermal imaging applications, demonstrating VIDLab's continued excellence in developing practical AI solutions for healthcare and safety applications.</p><div class='news_footer text-center'><a href='https://www.sciencedirect.com/science/article/pii/S0952197625018214' class='btn btn-light btn-custom'>View Paper</a></div>"
  }
]