[
  {
    "id": "news-1",
    "title": "Congratulations to Our 2025 Graduates at Lakehead University Convocation",
    "summary": "VIDLab celebrates the academic achievements of Nusrat Jahan, Harish Sundaralingam, and Tharrengini Suresh who attended the Spring 2025 Convocation ceremony at Lakehead University.",
    "image": "assets/images/gallery/Convocation (1).jpg",
    "date": "June 15, 2025",
    "content": "<h5>Celebrating Academic Excellence and Research Achievements!</h5><p>We are incredibly proud to congratulate our outstanding graduates Nusrat Jahan, Harish Sundaralingam, and Tharrengini Suresh who participated in Lakehead University's Spring 2025 Convocation ceremony. Their dedication to research and academic excellence exemplifies the high standards of VIDLab.</p><p>The Spring 2025 Convocation at Lakehead University took place at the C.J. Sanders Fieldhouse, celebrating the achievements of graduating students across all faculties. Our graduates have made significant contributions to computer vision and machine learning research during their time at VIDLab.</p><div class='row g-3 my-3'><div class='col-md-6'><img src='assets/images/gallery/Convocation (1).jpg' class='img-fluid rounded' alt='VIDLab Convocation 2025'></div><div class='col-md-6'><img src='assets/images/gallery/Convocation (2).jpg' class='img-fluid rounded' alt='Lakehead University Convocation Ceremony'></div></div><p>Dr. Akilan commented: 'Watching our students achieve their academic milestones is one of the most rewarding aspects of leading VIDLab. Nusrat, Harish, and Tharrengini have demonstrated exceptional research capabilities and dedication. Their work in areas ranging from semantic segmentation to object detection will have lasting impact on the field.'</p><p><strong>Graduate Achievements:</strong></p><ul><li><strong>Nusrat Jahan:</strong> Completed her MSc in Computer Science with research focus on advanced machine learning applications</li><li><strong>Harish Sundaralingam:</strong> Achieved his MSc in Electrical and Computer Engineering, specializing in object detection and attention mechanisms</li><li><strong>Tharrengini Suresh:</strong> Graduated with distinction, contributing to innovative computer vision solutions</li></ul><p>We wish our graduates continued success in their future endeavors and look forward to their continued contributions to the field of intelligent systems and data analytics.</p><div class='news_footer text-center'><a href='https://www.lakeheadu.ca/about/news-and-events/convocation' class='btn btn-light btn-custom'>Learn More About Lakehead Convocation</a></div>"
  },
  {
    "id": "news-2",
    "title": "Dr. Akilan to Present at International Conference on Computer Vision and Machine Learning",
    "summary": "VIDLab director Dr. T. Akilan will be presenting recent research findings at a prestigious international conference, showcasing innovative developments in vision intelligence and data analytics.",
    "image": "assets/images/news/news (2).jpg",
    "date": "July 8, 2025",
    "content": "<h5>VIDLab Research to be Featured at International Conference!</h5><p>We are excited to announce that Dr. T. Akilan, Director of VIDLab, will be presenting at the upcoming International Conference on Computer Vision and Machine Learning (ICCVML 2025). This prestigious event brings together leading researchers and industry experts from around the world.</p><p>Dr. Akilan's presentation will focus on recent breakthroughs in semantic segmentation and their applications to real-world problems in healthcare, agriculture, and autonomous systems. The talk will highlight innovative methodologies developed at VIDLab that have achieved significant improvements in both accuracy and computational efficiency.</p><p>Conference Details:</p><ul><li><strong>Event:</strong> International Conference on Computer Vision and Machine Learning 2025</li><li><strong>Date:</strong> July 22-24, 2025</li><li><strong>Location:</strong> Toronto Convention Centre, Toronto, ON</li><li><strong>Presentation Topic:</strong> 'Advancing Intelligent Systems through Efficient Vision Intelligence Solutions'</li></ul><p>Dr. Akilan commented: 'This conference provides an excellent opportunity to share our latest research findings with the global computer vision community. I look forward to presenting our work on developing practical AI solutions that address real-world challenges while maintaining computational efficiency.'</p><p>The presentation will showcase collaborative research conducted at VIDLab, including partnerships with industry and other academic institutions. This reflects our commitment to translating cutting-edge research into practical applications that benefit society.</p><div class='news_footer text-center'><a href='#' class='btn btn-light btn-custom'>Conference Information</a></div>"
  },
  {
    "id": "news-3",
    "title": "VIDLab Advances Pavement Crack Detection for Smart Infrastructure",
    "summary": "Lab develops lightweight model achieving 1.85% improvement in mIoU with efficient 237ms inference time, addressing critical challenges in autonomous driving and smart highway infrastructure.",
    "image": "assets/images/news/news (3).jpg",
    "date": "April 10, 2025",
    "content": "<h5>Significant Progress in Smart Infrastructure Technology!</h5><p>VIDLab has developed a groundbreaking lightweight model for pavement crack segmentation that integrates attention mechanisms and self-gated activation. This innovative approach has achieved a notable 1.85% improvement in mean intersection over union (mIoU) while maintaining an efficient per-sample inference time of just 237ms.</p><p>The model's efficiency makes it exceptionally well-suited for real-time applications in autonomous driving and smart highway infrastructure management. Extensive experiments conducted on two benchmark datasets have validated its superior performance against recent state-of-the-art methods.</p><p>Dr. Akilan emphasized the practical impact: 'This research addresses critical real-world challenges in infrastructure monitoring. Our model is specifically designed to handle varying lighting conditions and large-scale pavement areas, which are common challenges in crack detection systems deployed in the field.'</p><p>The research maintains high accuracy while ensuring computational efficiency, making it viable for deployment in resource-constrained environments typical of roadside monitoring systems. This work contributes significantly to the development of intelligent transportation systems and proactive infrastructure maintenance.</p><div class='news_footer text-center'><a href='https://ieeexplore.ieee.org/abstract/document/10667187' class='btn btn-light btn-custom'>Read the Full Paper</a></div>"
  }
]
